package com.appsflyer.internal;
/* renamed from: com.appsflyer.internal.d */
/* loaded from: classes-dex2jar.jar:com/appsflyer/internal/d.class */
public class C1842d {

    /* renamed from: ŀ */
    public static byte[] f1845;

    /* renamed from: ł */
    public static Object f1846;

    /* renamed from: ſ */
    public static int f1847 = 0;

    /* renamed from: ƚ */
    public static final byte[] f1849 = null;

    /* renamed from: ɔ */
    public static int f1851 = 1;

    /* renamed from: ɿ */
    public static Object f1852;

    /* renamed from: ʅ */
    public static int f1853;

    /* renamed from: г */
    public static byte[] f1854;

    /* renamed from: ɍ */
    public static long f1850 = -4563979436785797051L;

    /* renamed from: Ɨ */
    public static int f1848 = -3;

    public static void $$a() {
        int i;
        int i2 = f1851;
        int i3 = (i2 & 9) + (i2 | 9);
        f1853 = i3 % 128;
        if ((i3 % 2 != 0 ? 'W' : '.') != 'W') {
            byte[] bArr = new byte[912];
            System.arraycopy("'\u009eÌÍú\u0018îÐ>\tÂ\u00176ô\u0003\u0002\u0010ö\u0002è(\u0005\b\u0002â$\u0001öÿ\u000f\u000f\u0001Ä6\u0012\u0003\u0006ö\t\u0010ï\u0010¿>\b\tô\u0010ÿö\u000eÅ:Â\u0003ú\u0018îÐAø\u0010üÊ()ý\u0004ô\u000b\u0015��\u0003ö\f\tÐ2\u0003ÿ��ý\u0001\u0016ø\t\u0002ú\u0018îÐCþ\tÂ\u0017:þôà6ô\u0003\u0002\u0010\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ8ÃK\u0010ù\u0011��ýþÍD\u0007¾\u00176÷\u0006ûÃ5ò\u0010\u0004ù\t\u0002ú\u0018îÐ>\tÂ\u0017:þôß4\u0003ò\u001bÓ(\u0005\b\u0002â$\u0001öÿ\u000f��\u000e\rö\u0005ÆH\tý\u0004ô\u000bÄ\u001e(â\u001b\u000b\u0005\u0006\nÎ$\u0016Î,ø\u0015\u0003Ü&õ\u0006\u0004\u0010öÿ\u0006å2ú\u0003\u0010\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ9Â\u0003\u0001\u0012Õ&\u0006ü\u0011Ô(\fþú\u000eô\u0001\u0012Ò!\u0005\b��â(\föÿ\u0006��\u000e\rö\u0005ÆH\tý\u0004ô\u000bÄ\u0019$\u0016Ñ&\u0006ü\u000fø\u0004ý\u0007\u0001\u0005\b����\u000e\rö\u0005ÆH\tý\u0004ô\u000bÄ\u0017\"\u0015õâ$\u0016Î,ø\u0015\u0003Ü&õ\u0006\u0004\u0010\u0001\u0012Ò/ø\u0004á!\u0005\b��â(\f\tøøî\nì\u000bI\u0004´Iþ\u000e\u0003ù\u0002\u0005\u000b\u000b°Oü\u0004\u0011¸î\tí\u000bî\u0007ï\u000bî\u000bë\u000bú\u0018îÐAø\u0010üÊ\u0018,ø\u0015\u0003Ü&õ\u0006\u0004\u0010\u0010ù\u0011��ýþÍ6\u0012\u0003Á\u00162\u0003Ú(\u0006ö\u0002\u000e\n\u0001\u0012Ô6ÿô\u0010ÿö\u000eê$þ\u0006ò\t\u0001â(\fö\u0001\u0014þ\u0006\n7\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ6Îú\u0018îÐ>\tÂ\u0019 \u0016ðë(\u0005\b\u0002â$\u0001öÿ\u000f\u0006õ\u0006ã$\u0016ú\u0018îÐ>\tÂ\u0017:þôß4\u0003ò\u001bÙ)\u0002ÿ\b\u0002â$\u0001öÿ\u000f\u0010ù\u0011��ýþÍD\u0007¾\u001a,\u000bö\f��\u0002\u0002û\f\tû\u0001\n\u0001\u0012Ò,ø\u0015\u0003Ü&õ\u0006\u0004\u00108��\u0016ðÑ8��\u0016ðÑ\u0004\nü\u0012ô\u0001\u0012Õ\u0001ô\n\u0017í\b\tö\u0016ø\u0010òê ü\u0013ò\u0014\nÚ\u0014\u0016÷à*ü\u000bû\f\t\u0002\f\u0006\u0007õ7\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ5Ïú\u0018îÐ>\tÂIü\u0006÷\b\f\u0001\u0012ß%��\u0004ø\u0010\u0005\b\u0001\u0012Ð$\u0014ÿ��\f\u0002ôî\u0014\u0016÷\u0010ù\u0011��ýþÍ6\u0012\u0003Á\u0016%\u0014ø\u0010ö\u000e\bÞ\u0017\röÿ\u0006ú\u0018îÐ>\tÂ\u001b&\u0006üí)\u0002ÿ\b\u0002â$\u0001öÿ\u000f\u0001\u0010ì\u001eú\u000eôú\u0018îÐ>\tÂ\u001e\tù6î\u0005\u000e\u0007ø\t\u0002ô\u0016÷ç \r\u0004\u0001\u0012Ø(þ\u000eøû\u000eØ2\u0003ÿ��ý\u0001\u0016ø\t\u0002ú\u0018îÐ>\tÂ\u001b&\u0006üî\u0006ð\u000b\u0015��\u0003ö\f\tã\u0018\u0007ûë\u001f\u0006\u0003��\rú\u0018îÐ>\tÂ\u001b&\u0006üâ$\u0011ó\u0012ú\n\u0007þ\u0006þÖ:þôß4\u0003ò\u001b\u0006õ\u0006â,ø\u0015\u0003\u000f\u0001Ä6\u0012\u0003\u0006ö\t\u0010ï\u0010þò\u0012ö\u0016ø\u0010òê ü\u0013ò\u0014\nÎ(\fö\u0001\u0014þ\u0006úÿ\u0011ú\u0018îÐ>\tÂ\u001e(\u0005\b\u0002â$\u0001öÿ\u000f".getBytes("ISO-8859-1"), 0, bArr, 0, 912);
            f1849 = bArr;
            i = 244;
        } else {
            byte[] bArr2 = new byte[912];
            System.arraycopy("'\u009eÌÍú\u0018îÐ>\tÂ\u00176ô\u0003\u0002\u0010ö\u0002è(\u0005\b\u0002â$\u0001öÿ\u000f\u000f\u0001Ä6\u0012\u0003\u0006ö\t\u0010ï\u0010¿>\b\tô\u0010ÿö\u000eÅ:Â\u0003ú\u0018îÐAø\u0010üÊ()ý\u0004ô\u000b\u0015��\u0003ö\f\tÐ2\u0003ÿ��ý\u0001\u0016ø\t\u0002ú\u0018îÐCþ\tÂ\u0017:þôà6ô\u0003\u0002\u0010\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ8ÃK\u0010ù\u0011��ýþÍD\u0007¾\u00176÷\u0006ûÃ5ò\u0010\u0004ù\t\u0002ú\u0018îÐ>\tÂ\u0017:þôß4\u0003ò\u001bÓ(\u0005\b\u0002â$\u0001öÿ\u000f��\u000e\rö\u0005ÆH\tý\u0004ô\u000bÄ\u001e(â\u001b\u000b\u0005\u0006\nÎ$\u0016Î,ø\u0015\u0003Ü&õ\u0006\u0004\u0010öÿ\u0006å2ú\u0003\u0010\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ9Â\u0003\u0001\u0012Õ&\u0006ü\u0011Ô(\fþú\u000eô\u0001\u0012Ò!\u0005\b��â(\föÿ\u0006��\u000e\rö\u0005ÆH\tý\u0004ô\u000bÄ\u0019$\u0016Ñ&\u0006ü\u000fø\u0004ý\u0007\u0001\u0005\b����\u000e\rö\u0005ÆH\tý\u0004ô\u000bÄ\u0017\"\u0015õâ$\u0016Î,ø\u0015\u0003Ü&õ\u0006\u0004\u0010\u0001\u0012Ò/ø\u0004á!\u0005\b��â(\f\tøøî\nì\u000bI\u0004´Iþ\u000e\u0003ù\u0002\u0005\u000b\u000b°Oü\u0004\u0011¸î\tí\u000bî\u0007ï\u000bî\u000bë\u000bú\u0018îÐAø\u0010üÊ\u0018,ø\u0015\u0003Ü&õ\u0006\u0004\u0010\u0010ù\u0011��ýþÍ6\u0012\u0003Á\u00162\u0003Ú(\u0006ö\u0002\u000e\n\u0001\u0012Ô6ÿô\u0010ÿö\u000eê$þ\u0006ò\t\u0001â(\fö\u0001\u0014þ\u0006\n7\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ6Îú\u0018îÐ>\tÂ\u0019 \u0016ðë(\u0005\b\u0002â$\u0001öÿ\u000f\u0006õ\u0006ã$\u0016ú\u0018îÐ>\tÂ\u0017:þôß4\u0003ò\u001bÙ)\u0002ÿ\b\u0002â$\u0001öÿ\u000f\u0010ù\u0011��ýþÍD\u0007¾\u001a,\u000bö\f��\u0002\u0002û\f\tû\u0001\n\u0001\u0012Ò,ø\u0015\u0003Ü&õ\u0006\u0004\u00108��\u0016ðÑ8��\u0016ðÑ\u0004\nü\u0012ô\u0001\u0012Õ\u0001ô\n\u0017í\b\tö\u0016ø\u0010òê ü\u0013ò\u0014\nÚ\u0014\u0016÷à*ü\u000bû\f\t\u0002\f\u0006\u0007õ7\u000f\u0001Å5\u0012\u0003\u0006ö\t\u0010ï\u0010À=\b\tô\u0010ÿö\u000eÆ5Ïú\u0018îÐ>\tÂIü\u0006÷\b\f\u0001\u0012ß%��\u0004ø\u0010\u0005\b\u0001\u0012Ð$\u0014ÿ��\f\u0002ôî\u0014\u0016÷\u0010ù\u0011��ýþÍ6\u0012\u0003Á\u0016%\u0014ø\u0010ö\u000e\bÞ\u0017\röÿ\u0006ú\u0018îÐ>\tÂ\u001b&\u0006üí)\u0002ÿ\b\u0002â$\u0001öÿ\u000f\u0001\u0010ì\u001eú\u000eôú\u0018îÐ>\tÂ\u001e\tù6î\u0005\u000e\u0007ø\t\u0002ô\u0016÷ç \r\u0004\u0001\u0012Ø(þ\u000eøû\u000eØ2\u0003ÿ��ý\u0001\u0016ø\t\u0002ú\u0018îÐ>\tÂ\u001b&\u0006üî\u0006ð\u000b\u0015��\u0003ö\f\tã\u0018\u0007ûë\u001f\u0006\u0003��\rú\u0018îÐ>\tÂ\u001b&\u0006üâ$\u0011ó\u0012ú\n\u0007þ\u0006þÖ:þôß4\u0003ò\u001b\u0006õ\u0006â,ø\u0015\u0003\u000f\u0001Ä6\u0012\u0003\u0006ö\t\u0010ï\u0010þò\u0012ö\u0016ø\u0010òê ü\u0013ò\u0014\nÎ(\fö\u0001\u0014þ\u0006úÿ\u0011ú\u0018îÐ>\tÂ\u001e(\u0005\b\u0002â$\u0001öÿ\u000f".getBytes("ISO-8859-1"), 0, bArr2, 0, 912);
            f1849 = bArr2;
            i = 7812;
        }
        f1847 = i;
    }

    /* JADX WARN: Removed duplicated region for block: B:23:0x00dd  */
    /* JADX WARN: Removed duplicated region for block: B:25:0x00e7  */
    /* JADX WARN: Unsupported multi-entry loop pattern (BACK_EDGE: B:25:0x00e7 -> B:26:0x010a). Please submit an issue!!! */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
        To view partially-correct add '--show-bad-code' argument
    */
    public static java.lang.String $$c(short r4, short r5, short r6) {
        /*
            Method dump skipped, instructions count: 312
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: com.appsflyer.internal.C1842d.$$c(short, short, short):java.lang.String");
    }

    /* JADX WARN: Can't wrap try/catch for region: R(76:2|855|3|4|5|6|(1:8)(1:9)|10|(3:906|11|12)|(62:14|21|(1:23)(1:24)|25|(63:27|(1:29)(1:30)|31|892|(1:33)(1:36)|34|35|38|(1:40)(1:41)|42|(53:876|44|46|(1:48)(1:49)|50|(47:869|52|54|(1:56)(4:57|(1:59)(1:60)|61|(1:63)(5:64|65|66|67|68))|69|(1:71)(8:72|73|74|75|76|(1:78)(1:79)|80|(2:82|83)(5:84|85|86|87|88))|89|90|(4:92|(1:94)(1:95)|96|(4:98|99|100|101))|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(1:125)(1:126)|127|(1:129)(1:130)|131|(1:133)(1:134)|135|(1:137)(1:138)|139|(1:141)(1:142)|143|(1:145)(1:146)|147|148|(6:153|(1:155)(1:156)|157|(8:159|(5:161|896|162|163|929)(23:167|(1:169)(1:170)|171|(1:173)(21:164|174|(3:176|177|(1:179)(1:925))(1:930)|764|765|766|767|768|769|770|771|772|773|774|775|776|777|778|779|780|781)|180|(20:919|182|859|183|184|185|857|186|187|188|189|853|190|191|849|192|193|(19:196|(1:198)(1:199)|200|(1:202)(2:203|(1:205)(4:206|(1:208)(1:209)|210|(3:212|(0)|214)(1:215)))|914|216|217|904|218|219|220|221|(4:224|(5:863|226|(2:228|229)(1:230)|231|941)(6:234|235|236|903|237|940)|238|222)|939|239|240|(3:242|243|937)(6:244|(1:246)(1:247)|248|(1:250)(4:252|(1:254)(1:255)|256|(2:258|259)(12:260|261|262|894|263|264|265|266|267|268|269|936))|251|938)|270|194)|935|287)(1:311)|312|901|313|314|315|316|317|318|319|320|321|322|323|324|325|326|(28:327|328|329|330|331|332|333|334|(5:842|336|337|836|338)(7:344|861|345|346|347|348|349)|339|340|350|921|351|352|353|354|355|356|912|357|(1:359)(1:360)|361|(54:825|363|(2:365|366)(1:367)|368|(1:370)(1:371)|372|910|373|899|374|375|376|889|377|378|(4:379|(1:381)(1:382)|383|(1:943)(14:385|386|387|851|388|389|390|391|845|392|393|(1:395)(1:396)|397|(4:399|885|400|401)(1:944)))|410|411|412|413|414|415|416|417|923|418|874|419|420|421|422|423|867|424|840|425|426|427|834|428|429|844|430|431|432|433|434|435|436|437|438|(5:440|441|442|916|443)|444|445)(62:908|540|541|542|543|544|545|546|547|548|(5:549|550|551|552|(1:1)(12:558|(1:560)(1:561)|562|(1:564)(1:565)|838|566|567|568|569|832|570|571))|580|581|582|583|584|585|879|586|587|588|589|(2:871|597)|598|599|600|601|602|(2:891|610)|611|612|613|614|615|616|617|618|619|620|621|622|623|883|624|625|626|627|628|629|630|631|865|632|633|(3:847|636|634)|947|638|639|640|(1:642)(1:643)|644|(1:646))|647|(10:649|650|651|652|653|654|655|656|657|(3:659|660|661))(7:664|665|666|667|668|830|669)|675|(28:677|678|679|680|829|681|682|683|684|685|(1:687)(1:688)|689|690|691|692|693|694|695|696|697|698|699|700|701|702|703|704|705)(12:942|706|707|708|709|710|(4:712|(1:714)(1:715)|716|(5:718|720|721|722|933))|719|720|721|722|933)))|785|(2:786|(5:788|789|(1:791)(1:792)|793|(1:795)(2:949|796))(2:948|797))|798|(1:800)(1:801)|802|(3:804|805|934)(5:931|806|807|808|809))(3:810|811|932)|812|149)|950)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(7:151|153|(0)(0)|157|(0)(0)|812|149)|927|813)|45|46|(0)(0)|50|(0)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(1:149)|927|813)|37|38|(0)(0)|42|(0)|45|46|(0)(0)|50|(0)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(1:149)|927|813)|17|887|18|19|21|(0)(0)|25|(0)|37|38|(0)(0)|42|(0)|45|46|(0)(0)|50|(0)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(1:149)|927|813|(1:(0))) */
    /* JADX WARN: Can't wrap try/catch for region: R(78:2|855|3|4|5|6|(1:8)(1:9)|10|906|11|12|(62:14|21|(1:23)(1:24)|25|(63:27|(1:29)(1:30)|31|892|(1:33)(1:36)|34|35|38|(1:40)(1:41)|42|(53:876|44|46|(1:48)(1:49)|50|(47:869|52|54|(1:56)(4:57|(1:59)(1:60)|61|(1:63)(5:64|65|66|67|68))|69|(1:71)(8:72|73|74|75|76|(1:78)(1:79)|80|(2:82|83)(5:84|85|86|87|88))|89|90|(4:92|(1:94)(1:95)|96|(4:98|99|100|101))|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(1:125)(1:126)|127|(1:129)(1:130)|131|(1:133)(1:134)|135|(1:137)(1:138)|139|(1:141)(1:142)|143|(1:145)(1:146)|147|148|(6:153|(1:155)(1:156)|157|(8:159|(5:161|896|162|163|929)(23:167|(1:169)(1:170)|171|(1:173)(21:164|174|(3:176|177|(1:179)(1:925))(1:930)|764|765|766|767|768|769|770|771|772|773|774|775|776|777|778|779|780|781)|180|(20:919|182|859|183|184|185|857|186|187|188|189|853|190|191|849|192|193|(19:196|(1:198)(1:199)|200|(1:202)(2:203|(1:205)(4:206|(1:208)(1:209)|210|(3:212|(0)|214)(1:215)))|914|216|217|904|218|219|220|221|(4:224|(5:863|226|(2:228|229)(1:230)|231|941)(6:234|235|236|903|237|940)|238|222)|939|239|240|(3:242|243|937)(6:244|(1:246)(1:247)|248|(1:250)(4:252|(1:254)(1:255)|256|(2:258|259)(12:260|261|262|894|263|264|265|266|267|268|269|936))|251|938)|270|194)|935|287)(1:311)|312|901|313|314|315|316|317|318|319|320|321|322|323|324|325|326|(28:327|328|329|330|331|332|333|334|(5:842|336|337|836|338)(7:344|861|345|346|347|348|349)|339|340|350|921|351|352|353|354|355|356|912|357|(1:359)(1:360)|361|(54:825|363|(2:365|366)(1:367)|368|(1:370)(1:371)|372|910|373|899|374|375|376|889|377|378|(4:379|(1:381)(1:382)|383|(1:943)(14:385|386|387|851|388|389|390|391|845|392|393|(1:395)(1:396)|397|(4:399|885|400|401)(1:944)))|410|411|412|413|414|415|416|417|923|418|874|419|420|421|422|423|867|424|840|425|426|427|834|428|429|844|430|431|432|433|434|435|436|437|438|(5:440|441|442|916|443)|444|445)(62:908|540|541|542|543|544|545|546|547|548|(5:549|550|551|552|(1:1)(12:558|(1:560)(1:561)|562|(1:564)(1:565)|838|566|567|568|569|832|570|571))|580|581|582|583|584|585|879|586|587|588|589|(2:871|597)|598|599|600|601|602|(2:891|610)|611|612|613|614|615|616|617|618|619|620|621|622|623|883|624|625|626|627|628|629|630|631|865|632|633|(3:847|636|634)|947|638|639|640|(1:642)(1:643)|644|(1:646))|647|(10:649|650|651|652|653|654|655|656|657|(3:659|660|661))(7:664|665|666|667|668|830|669)|675|(28:677|678|679|680|829|681|682|683|684|685|(1:687)(1:688)|689|690|691|692|693|694|695|696|697|698|699|700|701|702|703|704|705)(12:942|706|707|708|709|710|(4:712|(1:714)(1:715)|716|(5:718|720|721|722|933))|719|720|721|722|933)))|785|(2:786|(5:788|789|(1:791)(1:792)|793|(1:795)(2:949|796))(2:948|797))|798|(1:800)(1:801)|802|(3:804|805|934)(5:931|806|807|808|809))(3:810|811|932)|812|149)|950)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(7:151|153|(0)(0)|157|(0)(0)|812|149)|927|813)|45|46|(0)(0)|50|(0)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(1:149)|927|813)|37|38|(0)(0)|42|(0)|45|46|(0)(0)|50|(0)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(1:149)|927|813)|17|887|18|19|21|(0)(0)|25|(0)|37|38|(0)(0)|42|(0)|45|46|(0)(0)|50|(0)|53|54|(0)(0)|69|(0)(0)|89|90|(0)|102|103|104|105|106|107|108|109|110|111|112|113|114|115|116|117|118|119|917|120|121|122|123|(0)(0)|127|(0)(0)|131|(0)(0)|135|(0)(0)|139|(0)(0)|143|(0)(0)|147|148|(1:149)|927|813|(1:(0))) */
    /* JADX WARN: Removed duplicated region for block: B:125:0x060e  */
    /* JADX WARN: Removed duplicated region for block: B:126:0x0615  */
    /* JADX WARN: Removed duplicated region for block: B:129:0x0620  */
    /* JADX WARN: Removed duplicated region for block: B:130:0x0626  */
    /* JADX WARN: Removed duplicated region for block: B:133:0x0653  */
    /* JADX WARN: Removed duplicated region for block: B:134:0x0674  */
    /* JADX WARN: Removed duplicated region for block: B:137:0x0684  */
    /* JADX WARN: Removed duplicated region for block: B:138:0x068a  */
    /* JADX WARN: Removed duplicated region for block: B:141:0x069a  */
    /* JADX WARN: Removed duplicated region for block: B:142:0x06a0  */
    /* JADX WARN: Removed duplicated region for block: B:145:0x06b2  */
    /* JADX WARN: Removed duplicated region for block: B:146:0x06b8  */
    /* JADX WARN: Removed duplicated region for block: B:151:0x06d5  */
    /* JADX WARN: Removed duplicated region for block: B:155:0x06e8  */
    /* JADX WARN: Removed duplicated region for block: B:156:0x06ee  */
    /* JADX WARN: Removed duplicated region for block: B:159:0x06f6  */
    /* JADX WARN: Removed duplicated region for block: B:23:0x00e2  */
    /* JADX WARN: Removed duplicated region for block: B:24:0x00e9  */
    /* JADX WARN: Removed duplicated region for block: B:27:0x00f4  */
    /* JADX WARN: Removed duplicated region for block: B:40:0x0173  */
    /* JADX WARN: Removed duplicated region for block: B:41:0x0179  */
    /* JADX WARN: Removed duplicated region for block: B:48:0x01b3  */
    /* JADX WARN: Removed duplicated region for block: B:49:0x01ba  */
    /* JADX WARN: Removed duplicated region for block: B:56:0x01f6  */
    /* JADX WARN: Removed duplicated region for block: B:57:0x01fd  */
    /* JADX WARN: Removed duplicated region for block: B:71:0x0295  */
    /* JADX WARN: Removed duplicated region for block: B:72:0x02ab  */
    /* JADX WARN: Removed duplicated region for block: B:788:0x2f97  */
    /* JADX WARN: Removed duplicated region for block: B:800:0x2fcb  */
    /* JADX WARN: Removed duplicated region for block: B:801:0x2fd2  */
    /* JADX WARN: Removed duplicated region for block: B:804:0x2fdd A[Catch: Exception -> 0x30d8, TRY_ENTER, TRY_LEAVE, TryCatch #82 {Exception -> 0x30d8, blocks: (B:3:0x0013, B:5:0x0021, B:8:0x0035, B:64:0x0217, B:66:0x0226, B:73:0x02b0, B:74:0x02cc, B:99:0x03f3, B:112:0x04c4, B:114:0x0520, B:116:0x0556, B:118:0x058c, B:120:0x05c7, B:122:0x05de, B:786:0x2f8f, B:804:0x2fdd, B:806:0x2fec, B:101:0x0406, B:83:0x034c, B:84:0x0384, B:86:0x0395, B:88:0x03bf, B:104:0x047b, B:106:0x0488, B:108:0x049a, B:110:0x04a9, B:75:0x02cf, B:808:0x3003, B:809:0x303a, B:68:0x025a), top: B:855:0x0013 }] */
    /* JADX WARN: Removed duplicated region for block: B:810:0x304f  */
    /* JADX WARN: Removed duplicated region for block: B:869:0x01c7 A[EXC_TOP_SPLITTER, SYNTHETIC] */
    /* JADX WARN: Removed duplicated region for block: B:876:0x0185 A[EXC_TOP_SPLITTER, SYNTHETIC] */
    /* JADX WARN: Removed duplicated region for block: B:92:0x03d6  */
    /* JADX WARN: Removed duplicated region for block: B:931:0x2fec A[SYNTHETIC] */
    /* JADX WARN: Removed duplicated region for block: B:948:0x2fc3 A[SYNTHETIC] */
    static {
        /*
            Method dump skipped, instructions count: 12546
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: com.appsflyer.internal.C1842d.m38404clinit():void");
    }

    /* renamed from: ǃ */
    public static Object m36132(int i, char c, int i2) {
        Object obj;
        int i3 = f1853;
        int i4 = ((i3 | 45) << 1) - (i3 ^ 45);
        f1851 = i4 % 128;
        char c2 = 0;
        if (i4 % 2 == 0) {
            obj = f1852;
            Object[] objArr = null;
            int length = objArr.length;
        } else {
            obj = f1852;
        }
        f1853 = (f1851 + 13) % 128;
        try {
            Class<?> cls = Class.forName($$c(f1849[544], f1849[288], (short) 854), true, (ClassLoader) f1846);
            short s = (short) 374;
            byte b = f1849[71];
            Object invoke = cls.getMethod($$c(s, b, (short) (b | 648)), Integer.TYPE, Character.TYPE, Integer.TYPE).invoke(obj, Integer.valueOf(i), Character.valueOf(c), Integer.valueOf(i2));
            int i5 = f1853 + 49;
            f1851 = i5 % 128;
            if (i5 % 2 != 0) {
                c2 = 19;
            }
            if (c2 == 19) {
                return invoke;
            }
            Object[] objArr2 = null;
            int length2 = objArr2.length;
            return invoke;
        } catch (Throwable th) {
            Throwable cause = th.getCause();
            if (cause != null) {
                throw cause;
            }
            throw th;
        }
    }

    /* renamed from: ɩ */
    public static int m36131(int i) {
        f1851 = ((f1853 + 28) - 1) % 128;
        Object obj = f1852;
        int i2 = f1853;
        f1851 = (((i2 | 101) << 1) - (i2 ^ 101)) % 128;
        try {
            Class<?> cls = Class.forName($$c(f1849[544], f1849[288], (short) 854), true, (ClassLoader) f1846);
            short s = (short) 730;
            byte b = f1849[71];
            int intValue = ((Integer) cls.getMethod($$c(s, b, (short) (b | 336)), Integer.TYPE).invoke(obj, Integer.valueOf(i))).intValue();
            f1853 = (f1851 + 67) % 128;
            return intValue;
        } catch (Throwable th) {
            Throwable cause = th.getCause();
            if (cause != null) {
                throw cause;
            }
            throw th;
        }
    }

    /* renamed from: ɩ */
    public static int m36130(Object obj) {
        int i = f1851;
        int i2 = (i ^ 7) + ((i & 7) << 1);
        f1853 = i2 % 128;
        if ((i2 % 2 != 0 ? '\b' : '\r') != '\r') {
            Object obj2 = f1852;
            throw new NullPointerException();
        }
        Object obj3 = f1852;
        int i3 = f1853;
        f1851 = ((i3 & 121) + (i3 | 121)) % 128;
        f1853 = ((f1851 + 76) - 1) % 128;
        try {
            Class<?> cls = Class.forName($$c(f1849[544], f1849[288], (short) 854), true, (ClassLoader) f1846);
            short s = (short) 382;
            byte b = f1849[71];
            return ((Integer) cls.getMethod($$c(s, b, b), Object.class).invoke(obj3, obj)).intValue();
        } catch (Throwable th) {
            Throwable cause = th.getCause();
            if (cause != null) {
                throw cause;
            }
            throw th;
        }
    }
}
